proficiency-test/app/controllers/classrooms_controller.rb

	def show
		@classroom = Classroom.find(params[:id])
---
SELECT  "classrooms".* FROM "classrooms"  WHERE "classrooms"."id" = $1 LIMIT 1