proficiency-test/app/controllers/subscribes_controller.rb

	def save
		@classroom = Classroom.find(1)
		student = Student.find(1)
---
SELECT  "classrooms".* FROM "classrooms"  WHERE "classrooms"."id" = $1 LIMIT 1
SELECT  "students".* FROM "students"  WHERE "students"."id" = $1 LIMIT 1