app/controllers/classrooms_controller.rb

SELECT  "classrooms".* FROM "classrooms"  LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "classrooms"
---
	def index
		@classrooms = Classroom.all.page(params[:page]).per(5)

SELECT  "classrooms".* FROM "classrooms"  WHERE "classrooms"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@classroom = Classroom.find(params[:id])