app/controllers/courses_controller.rb

	def index
		@courses = Course.all.page(params[:page]).per(5)
---
SELECT  "courses".* FROM "courses"  LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "courses"