app/controllers/students_controller.rb

	def index
		@students = Student.all.page(params[:page]).per(5)
---
SELECT  "students".* FROM "students"  LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "students"