app/controllers/subscribes_controller.rb

	def index
		@classrooms = Classroom.select(:id, :name).joins(:course)
		@students = Student.all
---
SELECT "classrooms"."id", name FROM "classrooms" INNER JOIN "courses" ON "courses"."id" = "classrooms"."course_id"
SELECT "students".* FROM "students"

	def save
		@classroom = Classroom.find(1)
		student = Student.find(1)
---
SELECT  "classrooms".* FROM "classrooms"  WHERE "classrooms"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "students".* FROM "students"  WHERE "students"."id" = $1 LIMIT 1  [["id", 1]]